In [1]:
import pandas as pd

In [2]:
df= pd.read_csv("student_data_DS.csv")

In [3]:
df.head()

  Student_ID   Age  Marks Grade  Attendance
0         S1  18.0   85.0     A        90.0
1         S2  19.0   78.0     B        85.0
2         S3  18.0    NaN     B        88.0
3         S4   NaN   88.0     A         NaN
4         S5  20.0   92.0     A        95.0

In [4]:
df.isnull()

    Student_ID    Age  Marks  Grade  Attendance
0        False  False  False  False       False
1        False  False  False  False       False
2        False  False   True  False       False
3        False   True  False  False        True
4        False  False  False  False       False
5        False  False   True  False       False
6        False   True  False   True       False
7        False  False  False  False       False
8        False  False  False  False        True
9        False  False   True  False       False
10       False  False  False  False       False
11       False  False  False  False       False
12       False   True  False   True        True
13       False  False   True  False       False
14       False  False  False  False       False
15       False  False  False  False       False
16       False  False   True  False       False
17       False  False  False  False        True
18       False   True  False   True       False
19       False  False  False  False       False
20       False  False   True  False       False
21       False  False  False  False        True
22       False  False  False  False       False
23       False  False  False  False       False
24       False   True  False   True       False

In [5]:
df.info

<bound method DataFrame.info of    Student_ID   Age  Marks Grade  Attendance
0          S1  18.0   85.0     A        90.0
1          S2  19.0   78.0     B        85.0
2          S3  18.0    NaN     B        88.0
3          S4   NaN   88.0     A         NaN
4          S5  20.0   92.0     A        95.0
5          S6  19.0    NaN     C        80.0
6          S7   NaN   75.0   NaN        82.0
7          S8  18.0   80.0     B        87.0
8          S9  21.0   90.0     A         NaN
9         S10  20.0    NaN     B        92.0
10        S11  19.0   70.0     C        78.0
11        S12  18.0   82.0     B        85.0
12        S13   NaN   76.0   NaN         NaN
13        S14  20.0    NaN     A        90.0
14        S15  21.0   89.0     A        93.0
15        S16  18.0   84.0     B        88.0
16        S17  19.0    NaN     C        80.0
17        S18  20.0   91.0     A         NaN
18        S19   NaN   77.0   NaN        84.0
19        S20  21.0   86.0     B        91.0
20        S21  18.0    NaN     C        79.0
21        S22  19.0   79.0     B         NaN
22        S23  20.0   88.0     A        89.0
23        S24  21.0   90.0     A        94.0
24        S25   NaN   81.0   NaN        86.0>

In [6]:
df.isnull()

    Student_ID    Age  Marks  Grade  Attendance
0        False  False  False  False       False
1        False  False  False  False       False
2        False  False   True  False       False
3        False   True  False  False        True
4        False  False  False  False       False
5        False  False   True  False       False
6        False   True  False   True       False
7        False  False  False  False       False
8        False  False  False  False        True
9        False  False   True  False       False
10       False  False  False  False       False
11       False  False  False  False       False
12       False   True  False   True        True
13       False  False   True  False       False
14       False  False  False  False       False
15       False  False  False  False       False
16       False  False   True  False       False
17       False  False  False  False        True
18       False   True  False   True       False
19       False  False  False  False       False
20       False  False   True  False       False
21       False  False  False  False        True
22       False  False  False  False       False
23       False  False  False  False       False
24       False   True  False   True       False

In [7]:
df.isnull().any()

Student_ID    False
Age            True
Marks          True
Grade          True
Attendance     True
dtype: bool

In [8]:
df['Marks'].isnull().sum()

np.int64(6)

In [9]:
#drop rows with missing values
df.dropna()

   Student_ID   Age  Marks Grade  Attendance
0          S1  18.0   85.0     A        90.0
1          S2  19.0   78.0     B        85.0
4          S5  20.0   92.0     A        95.0
7          S8  18.0   80.0     B        87.0
10        S11  19.0   70.0     C        78.0
11        S12  18.0   82.0     B        85.0
14        S15  21.0   89.0     A        93.0
15        S16  18.0   84.0     B        88.0
19        S20  21.0   86.0     B        91.0
22        S23  20.0   88.0     A        89.0
23        S24  21.0   90.0     A        94.0